[["What do you get when you cross a tree with a baseball player?", "Babe Root. "],
["Who's the most famous Los Angeles Dodger?", "O.J. Simpson."],
["Why are Cubs fans bad lovers?", "Not only do they come up short but they always finish early. "],
["How do you know if you have a female umpire?", "She remembers the details of every single argument, and will also bring up arguments from previous games. "],
["Today I was asked how I view lesbian relationships, apparently “in HD” wasn’t the right answer"],
["Life and beer are very similar .....chill for best results"],
["Take me drunk I'm home"],
["What did the baseball glove say to the ball?","Catch ya later!"],
["Why are umpires so fat?","They always clean their plate!"],
["How do baseball players keep in touch?","They touch base every once in a while."],
["Why was Cinderella kicked off the baseball team?", "She ran away from the ball"],
["Whats the difference between Amy Winehouse and Captain Morgan?","Captain Morgan comes alive when you add coke!"],
["What does a drunk walrus have in common with a woman at a tupperware party?","They're both out looking for a tight seal."],
["What is printed on the bottom of beer bottles in the south? ", "Open the other end"],
["Did you hear about the guy who invented Lifesavers? They say he made a mint."],
["A ham sandwich walks into a bar and orders a beer. Bartender says, 'Sorry we don’t serve food here.'"],
["Whenever the cashier at the grocery store asks my dad if he would like the milk in a bag he replies, ‘No, just leave it in the carton!"],
["Why do chicken coops only have two doors? ", "Because if they had four, they would be chicken sedans!"],
["Two peanuts were walking down the street. One was a salted."],
["I used to have a job at a calendar factory but I got the sack because I took a couple of days off."],
["Two guys walk into a bar, the third one ducks."],
["5/4 of people admit that they’re bad with fractions."],
["I lent a hot girl my umbrella yesterday... That makes the number of girls I've made wet this year to -1"]]